/* No comment provided by engineer. */
"About Verbatim Solutions" = "Tietoja Verbatim Solutionsista";

/* No comment provided by engineer. */
"Verbi™ powered by Verbatim Solutions" = "Verbi™ powered by Verbatim Solutions";

/* No comment provided by engineer. */
"Tap here to begin typing.." = "Napsauta tästä kirjoittaaksesi";

/* No comment provided by engineer. */
"All translation history has been cleared." = "Käännöshistoria on tyhjennetty kokonaan.";

/* No comment provided by engineer. */
"Are you sure you want to clear all translation history?  Your previous translations will not show up as suggestions anymore." = "Haluatko varmasti tyhjentää käännöshistorian kokonaan?  Edellisiä käännöksiäsi ei enää ehdoteta automaattisesti.";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Clear" = "Tyhjennä";

/* No comment provided by engineer. */
"Clear Translation History" = "Tyhjennä käännöshistoria";

/* No comment provided by engineer. */
"Done" = "Valmis";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Professional Quote" = "Tarjouspyyntö";

/* No comment provided by engineer. */
"Request Professional Quote" = "Tee tarjouspyyntö";

/* No comment provided by engineer. */
"Submitting.." = "Lähetetään…";

/* No comment provided by engineer. */
"Translating.." = "Käännetään";

/* No comment provided by engineer. */
"Verbi™ is powered by Verbatim Solutions, a leading professional translation services provider.  Verbi™ provides you quick machine translations and is not a substitute for certified, professional translation services.  For a professional translation provided by one of our certified translators please contact us at" = "Verbi™:n on tuottanut Verbatim Solutions, joka on käännösalan johtava palveluntarjoaja.  Verbi™ tarjoaa nopeaa konekäännöspalvelua, joka ei kuitenkaan korvaa sertifioidun ammattikääntäjän palvelua.  Mikäli haluat käyttää sertifioitujen kääntäjiemme käännöspalveluja, ota meihin yhteyttä:";

/* No comment provided by engineer. */
"Mail:" = "Sähköpostitse:";

/* No comment provided by engineer. */
"Call:" = "Puhelimitse:";

/* No comment provided by engineer. */
"Online:" = "Verkossa:";

/* No comment provided by engineer. */
"Verbi™ Translate" = "Verbi™ Translate";

/* No comment provided by engineer. */
"We're sorry, an error has occurred.  Please try again." = "Pahoittelemme, tapahtui virhe.  Ole hyvä ja yritä uudestaan.";

/* No comment provided by engineer. */
"An internet connection is required to continue." = "An internet connection is required to continue.";

/* No comment provided by engineer. */
"We're missing a background for the selected language. Please restart the application.  If the problem persists, please uninstall and re-install." = "We're missing a background for the selected language. Please restart the application.  If the problem persists, please uninstall and re-install.";

/* No comment provided by engineer. */
"Missing theme information for '%'. Please close and restart.  If this problem continues, please uninstall and re-install." = "Missing theme information for '%'. Please close and restart.  If this problem continues, please uninstall and re-install.";